#!/usr/bin/env python
# coding=utf-8

#问题空间
'''
初始状态——一开始时的不完全的信息或令人不满意的状况
目标状态——你希望获得的信息或状态
操作——为了从初始状态迈向目标状态，你可能采取的步骤
'''

#对象 objec Python中的一切都是对象“万物皆对象”
def obj():
    '''
    对象：一个对象有自己的状态、行为和唯一的标识；所有相同类型的对象所具有的结构和行为在他们共同的类中被定义
    状态（state）：包括这个对象已有的属性（通常是类里面已经定义好的）在加上对象具有的当前属性值（这些属性往往是动态的）
    行为（behavior）：是指一个对象如何影响外界及被外界影响，表现为对象自身状态的改变和信息的传递。
    标识（identity）：是指一个对象所具有的区别于所有其它对象的属性。（本质上指内存中所创建的对象的地址）
    :return:
    '''
    pass

class 美女:
    胸围 = 90
    腰围 = 58
    臀围 = 83
    皮肤 = white
    唱歌()
    做饭()

#类的实例
王美女 = 美女()
a = 王美女.胸围